#+TITLE: Java Lists
#+AUTHOR: Dat Adithya

** ArrayList
The elements in this data structure can be randomly accessed.
Maintains it's insertion order and is non-synchronized.

#+HEADERS: :classname TestingLists
#+BEGIN_SRC java :results output :imports java.util.ArrayList
class TestingLists{
    public static void main(String[] args){
        ArrayList<Integer> list1 = new ArrayList<Integer>();
        list1.add(10);
        list1.add(20);
        list1.add(30);
        list1.add(40);

        Integer[] intArray = new Integer[list1.size()];
        intArray = list1.toArray(intArray);
        for(int i = 0; i < list1.size(); i++){
            System.out.println(intArray[i]);
        }
    }
}
#+END_SRC

#+RESULTS:
#+begin_example
jangofett

[31m   ▄█████▄ [32m   ▄█████▄ [33m   ▄█████▄ [34m   ▄█████▄ [35m   ▄█████▄ [36m   ▄█████▄
[31m   █▄▄ ▄▄█ [32m   █▄▄ ▄▄█ [33m   █▄▄ ▄▄█ [34m   █▄▄ ▄▄█ [35m   █▄▄ ▄▄█ [36m   █▄▄ ▄▄█
[31m   ███ ███ [32m   ███ ███ [33m   ███ ███ [34m   ███ ███ [35m   ███ ███ [36m   ███ ███
[31m   ▀██ ██▀ [32m   ▀██ ██▀ [33m   ▀██ ██▀ [34m   ▀██ ██▀ [35m   ▀██ ██▀ [36m   ▀██ ██▀
[31m     ▀ ▀   [32m     ▀ ▀   [33m     ▀ ▀   [34m     ▀ ▀   [35m     ▀ ▀   [36m     ▀ ▀
[1m
[31m   ▄█████▄ [32m   ▄█████▄ [33m   ▄█████▄ [34m   ▄█████▄ [35m   ▄█████▄ [36m   ▄█████▄
[31m   █▄▄ ▄▄█ [32m   █▄▄ ▄▄█ [33m   █▄▄ ▄▄█ [34m   █▄▄ ▄▄█ [35m   █▄▄ ▄▄█ [36m   █▄▄ ▄▄█
[31m   ███ ███ [32m   ███ ███ [33m   ███ ███ [34m   ███ ███ [35m   ███ ███ [36m   ███ ███
[31m   ▀██ ██▀ [32m   ▀██ ██▀ [33m   ▀██ ██▀ [34m   ▀██ ██▀ [35m   ▀██ ██▀ [36m   ▀██ ██▀
[31m     ▀ ▀   [32m     ▀ ▀   [33m     ▀ ▀   [34m     ▀ ▀   [35m     ▀ ▀   [36m     ▀ ▀
[0m

10
20
30
40
#+end_example

